Show / Hide Table of Contents
Class ReportSettings
Report settings for IDEA connections.
Inheritance
System.Object
ReportSettings
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class ReportSettings
Properties
Improve this Doc   View Source
CultureName
The name of the required culture of the report
Declaration
[DataMember]
public string CultureName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Formulas
Indicates if formulas are in report
Declaration
[DataMember]
public FormulasType Formulas { get; set; }
Property Value
 Type |  Description
 FormulasType
Improve this Doc   View Source
PlatesDrawings
Indicates, whether generate drawing of plates.
Declaration
[DataMember]
public bool PlatesDrawings { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ReportType
Gets or sets the type of report.
Declaration
[DataMember]
public ReportType ReportType { get; set; }
Property Value
 Type |  Description
 ReportType
Improve this Doc   View Source
ResultsPictures
Indicates, whether generate pictures of results.
Declaration
[DataMember]
public bool ResultsPictures { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SymbolExplanations
Indicates, whether generate explanations to report.
Declaration
[DataMember]
public bool SymbolExplanations { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
TheoreticalBackground
Indicates, whether generate theoretical background.
Declaration
[DataMember]
public bool TheoreticalBackground { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Unit
The name of the required culture of the report
Declaration
[DataMember]
public UnitType Unit { get; set; }
Property Value
 Type |  Description
 UnitType
Improve this Doc   View Source
Views
Indicates, whether generate views (XY, XZ, YZ) into report.
Declaration
[DataMember]
public bool Views { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source